// Задача 41: Пользователь вводит с клавиатуры M чисел. 
// Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

Console.Write("$Ввести информацию:"  );

int a = int.Parse(Console.ReadLine());

char input = char.Parse(Console.ReadLine());

int b = int.Parse(Console.ReadLine());

